<a href="https://colab.research.google.com/github/IrisMon/Priorizacion_Descuentos_Peru/blob/Iris/DescriptivoAnalisis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [6]:
### Importamos los data set clients_attributes
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "clients_attributes.csv"
fullpath = os.path.join(urlpath, filename)
df_clients= pd.read_csv(fullpath)
df_clients.head()

   Cliente FechaAltaCliente  Region  ...  TipoPoblacion  Estrato  EF
0        1       2009-03-03       4  ...              1        1   1
1        9       2009-03-03       4  ...              2        3   1
2       15       2009-03-03       4  ...              2        3   0
3       37       2009-03-03       4  ...              2        3   1
4       43       2009-03-03       4  ...              2        3   0

[5 rows x 8 columns]

In [7]:
### Importamos los data set --- 
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "executed_promos.csv"
fullpath = os.path.join(urlpath, filename)
df_Expromos= pd.read_csv(fullpath)
df_Expromos.head()

   CodigoDC  Cliente  Marca  Cupo
0    297601     8410     29     9
1    297601     9337     29     9
2    309843     7404     40    16
3    309874     4017     40    16
4    309910     6316     40    16

In [8]:
### Importamos los data set active_promos
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "active_promos.csv"
fullpath = os.path.join(urlpath, filename)
df_actpromos= pd.read_csv(fullpath)
df_actpromos.head()

   CodigoDC  Marca  Cupo Fecha_Desde Fecha_Hasta  Cliente
0    297601     29     9  2018-08-06  2018-08-30     3213
1    297601     29     9  2018-08-06  2018-08-30     3795
2    297601     29     9  2018-08-06  2018-08-30    11816
3    298856     40    16  2018-08-12  2018-08-19     8444
4    309916     40    16  2018-08-12  2018-08-19     8488

In [9]:
### Importamos los data set active_promos
urlpath = "https://raw.githubusercontent.com/IrisMon/Priorizacion_Descuentos_Peru/main/"
filename = "sales.csv"
fullpath = os.path.join(urlpath, filename)
df_sales= pd.read_csv(fullpath,encoding='ISO-8859-1')
df_sales.head()

   Cliente   A単o  Mes  ClaseEnvase  ...  Cupo        Nr    Hl    Dcto
0        1  2018    1            2  ...  10.0   6352.94  0.03     0.0
1        1  2018    1            2  ...  16.0  99130.50  0.45     0.0
2        1  2018    6            2  ...   6.0  11605.40  0.07 -2880.0
3        1  2018    7            1  ...  34.0   1944.01  0.01     0.0
4        1  2018    8            2  ...  16.0  16250.18  0.06     0.0

[5 rows x 10 columns]

## Analisis Descriptivo
Primero Crearemos un solo data set para comenzar a realizar el analisis descriptivo en busca de inshigt

In [11]:

print('Numero de registros en Sales data;  '+ str(df_sales.Cliente.count()))
print('Numero de registros en Executed promos data;  '+ str(df_Expromos.CodigoDC.count()))
print('Numero de registros en Client attributes data;  '+ str(df_clients.Cliente.count()))
print('Numero de registros en Active promos data;  '+ str(df_actpromos.CodigoDC.count()))

Numero de registros en Sales data;  1894252
Numero de registros en Executed promos data;  27794
Numero de registros en Client attributes data;  15069
Numero de registros en Active promos data;  422437

In [12]:
#df_sales['IngresoNeto'] = round(df_sales['Nr'],2).apply(int)
df_sales['IngresoNeto'] = df_sales['Nr']

In [15]:
del df_sales['Nr']

In [16]:
df_sales.head(3)

   Cliente   A単o  Mes  ClaseEnvase  ...  Cupo    Hl    Dcto  IngresoNeto
0        1  2018    1            2  ...  10.0  0.03     0.0      6352.94
1        1  2018    1            2  ...  16.0  0.45     0.0     99130.50
2        1  2018    6            2  ...   6.0  0.07 -2880.0     11605.40

[3 rows x 10 columns]